################################################################################
## ~/.Brewfile
##
## Gotchas:
## - `moreutils` installs its own old version of parallel, which conflicts with
##   the `parallel` formula; install `gettext`, `parallel` and `sponge` instead
##
## Sources:
## - https://github.com/Homebrew/homebrew-bundle
################################################################################

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "asdf"
brew "chezmoi"
brew "diff-pdf"
brew "git-lfs"
brew "mas"
brew "parallel"
brew "pre-commit"
brew "python-yq"
brew "rename"
brew "sponge"

cask_args appdir: "~/Applications"

cask "aldente"
cask "desmume"
cask "docker"
cask "firefox"
cask "gpg-suite-no-mail"
cask "iterm2"
cask "keka"
cask "little-snitch", args: { appdir: "/Applications" }
cask "monitorcontrol"
cask "openzfs"
cask "skype"
cask "spotify"
cask "steam"
cask "vlc"

mas "be focused", id: 973134470
mas "prime video", id: 545519333
mas "whatsapp", id: 1147396723
mas "xcode", id: 497799835
